In [1]:
import pandas as pd
import numpy as np

In [2]:
income_data = pd.read_csv("age1.csv")

In [5]:
income_data.head(6)

   Age  Income
0   20   10000
1   30   15000
2   80   50000
3   50   30000
4   10    5000
5   45   25000

In [4]:
income_data

   Age  Income
0   20   10000
1   30   15000
2   80   50000
3   50   30000
4   10    5000
5   45   25000
6   30   20000
7   55   35000
8   60   40000
9   70   45000

In [ ]:
X = income_data["Age"]   # independent variable
#vetical split 
Y = income_data["Income"]  # dependent variable

In [8]:
X,Y

(0    20
 1    30
 2    80
 3    50
 4    10
 5    45
 6    30
 7    55
 8    60
 9    70
 Name: Age, dtype: int64,
 0    10000
 1    15000
 2    50000
 3    30000
 4     5000
 5    25000
 6    20000
 7    35000
 8    40000
 9    45000
 Name: Income, dtype: int64)

sklearn and sckit-learn   are same

In [13]:
from sklearn.model_selection import train_test_split

In [40]:
X_train,X_test,Y_train,Y_test = train_test_split(X,Y,train_size=0.8,test_size=0.2,random_state=0,)

In [41]:
X_train,X_test,Y_train,Y_test

(4    10
 9    70
 1    30
 6    30
 7    55
 3    50
 0    20
 5    45
 Name: Age, dtype: int64,
 2    80
 8    60
 Name: Age, dtype: int64,
 4     5000
 9    45000
 1    15000
 6    20000
 7    35000
 3    30000
 0    10000
 5    25000
 Name: Income, dtype: int64,
 2    50000
 8    40000
 Name: Income, dtype: int64)

Using Iris dataset
   ->  setosa , virginca

In [66]:
iris = pd.read_csv("Iris_dataset.csv")

In [67]:
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [44]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [48]:
iris.Species.info()

<class 'pandas.core.series.Series'>
RangeIndex: 150 entries, 0 to 149
Series name: Species
Non-Null Count  Dtype
--------------  -----
150 non-null    object
dtypes: object(1)
memory usage: 1.3+ KB

In [65]:
from sklearn.datasets import load_iris
import pandas as pd
iris_dataset =  load_iris()
iris_tabel = pd.DataFrame(iris_dataset.data , columns=iris_dataset.feature_names)

In [64]:
pd.DataFrame(iris_dataset,columns=feature_names)

NameError: name 'feature_names' is not defined

In [69]:
from sklearn.datasets import load_iris